{
  "homePage": {
    "Main": {
      "header": "United Nations Sustainable Development Goals",
      "pageContent": {
        "goal1": {
          "goal1Heading": "Affordable and Clean Energy",
          "goal1Text": "Energy is central to nearly every major challenge and opportunity the world faces today. Be it for jobs, security, climate change, food production or increasing incomes, access to energy for all is essential. Working towards this goal is especially important as is interlinks with other Sustainable Development Goals.",
          "goal1Button": {
            "href": "goal1.html",
            "text": "Read More"
          },
          "goal1Image": {
            "src": "images/wind-turbines.png",
            "alt": "Wind Turbines"
          }
        },
        "goal2": {
          "goal2Heading": "Responsible Consumption and Production",
          "goal2Text": "The world is seriously off track in its effort to halve per-capita food waste and losses by 2030. The COVID-19 pandemic has had significant impacts on consumption and production patterns, with disruptions to global supply chains and changes in consumer behaviour. Responsible consumption and production must be an integral part of the recovery from the pandemic. ",
          "goal2Button": {
            "href": "goal2.html",
            "text": "Read More"
          },
          "goal2Image": {
            "src": "images/recycling.png",
            "alt": "Bottles being recycled"
          }
        },
        "goal3": {
          "goal3Heading": "Climate Action",
          "goal3Text": "The world is on the brink of a climate catastrophe and current actions and plans to address the crisis are insufficient. Without transformative action starting now and within this decade to reduce greenhouse gas emissions deeply and rapidly in all sectors, the 1.5°C target will be at risk and with it the lives of more than 3 billion people. Failure to act leads to intensifying heatwaves, droughts, flooding, wildfires, sea-level rise, and famines.",
          "goal3Button": {
            "href": "goal3.html",
            "text": "Read More"
          },
          "goal3Image": {
            "src": "images/climate-change.png",
            "alt": "Wind Turbines"
          }
        }
      }
    }
  },

   "goal1": {
    "Main": {
      "header": "Affordable and Clean Energy",
      "goal1Image": {
        "src": "images/sun-windturbine.jpg",
        "alt": "Goal 1 Image",
        "class": "goal-image"
      },
      "goal1text": {
        "text":"Lack of access to energy supplies and transformation systems is a constraint to human and economic development. The environment provides a series of renewable and non-renewable energy sources i.e. solar, wind, hydropower, geothermal, biofuels, natural gas, coal, petroleum, uranium. Increased use of fossil fuels without actions to mitigate greenhouse gases will have global climate change implications. Energy efficiency and increase use of renewables contribute to climate change mitigation and disaster risk reduction. Maintaining and protecting ecosystems allow using and further developing hydropower sources of electricity and bioenergy.",
        "class": "goal-text"
      }

      
    }
  },

  "goal2": {
    "Main": {
      "header": "Responsible Consumption and Production",
      "goal2Image": {
        "src": "images/sdg-12-responsible-consumption-and-production-share.jpg",
        "alt": "Goal 2 Image",
        "class": "goal-image"
      },
      "goal2text": {
        "text": "One of the greatest global challenges is to integrate environmental sustainability with economic growth and welfare by decoupling environmental degradation from economic growth and doing more with less. Resource decoupling and impact decoupling are needed to promote sustainable consumption and production patterns and to make the transition towards a greener and more socially inclusive global economy. To ensure sustainable consumption and production practices necessarily entails to respect the biophysical boundaries of the planet and to reduce current global consumption rates in order to fit with the biophysical capacity to produce",
        "class": "goal-text"
      }
    }
  },

  "goal3": {
    "Main": {
      "header": "Climate Action",
      "goal3Image": {
        "src": "images/climate-change-1603470824021.jpg",
        "alt": "Goal 3 Image",
        "class": "goal-image"
      },
      "goal3text": {
        "text": "Climate change is increasing the frequency and intensity of extreme weather events such as heat waves, droughts, floods and tropical cyclones, aggravating water management problems, reducing agricultural production and food security, increasing health risks, damaging critical infrastructure and interrupting the provision of basic services such water and sanitation, education, energy and transport. From 1880 to 2012, average global temperature increased by 0.85°C, Oceans have warmed, the amounts of snow and ice have diminished and sea level has risen. From 1901 to 2010, the global average sea level rose by 19 cm as oceans expanded. The Arctic’s sea ice extent has shrunk in every successive decade since 1979, Global emissions of carbon dioxide (CO2) have increased by almost 50 per cent since 1990, Emissions grew more quickly between 2000 and 2010 than in each of the three previous decades",
        "class": "goal-text"
      }
    }
  },

  "signupPage": {
    "main": {
      "image": {
        "src": "images/Children-planting-trees-1.jpeg",
        "alt": "Your Image"
      },
      "header": "Subscribe Now",
      "text1": "Never miss an update",
      "text2": "We won't send you any spam, you can unsubscribe at any time"
    },

    "form": {
      "name": "signupForm",
      "onsubmit": "return validateFields()",

      "inputs": {
        "fname": {
          "name": "Fname",
          "placeholder": "First Name"
        },
        "lname": {
          "name": "Lname",
          "placeholder": "Last Name"
        },
        "email": {
          "name": "Email",
          "placeholder": "Email"
        },
        "message": {
          "name": "message",
          "rows": "4",
          "collumns": "50",
          "placeholder": "Type your message here"
        }
      },
      "button": {
        "value": "Subscribe"
      }
    }
  },

  "aboutPage": {
    "Main": {
      "header": "Meet Group M6!",
      "teamText": {
        "person1": {
          "img": {
            "src": "images/profile-picture.png",
            "alt": "Profile Picture",
            "class": "profile-picture"
          },
          "name": "Toby Watts",
          "bio": "Hi, I'm Toby. I am a first year computer science student at the University of East Anglia. My contributions to the website include the home page, the about page and the hamburger menu."
        },
        "person2": {
          "img": {
            "src": "images/profile-picture.png",
            "alt": "Profile Picture",
            "class": "profile-picture"
          },
          "name": "Jules Tournier",
          "bio": "Hi, I'm Jules, I'm the coordinater and I have coded the signup page (including “signup.html”, “signup,css”, “signup.js”, “formData.json”) and the “app.js”"
        },
        "person3": {
          "img": {
            "src": "images/profile-picture.png",
            "alt": "Profile Picture",
            "class": "profile-picture"
          },
          "name": "Tom Walker",
          "bio": "Hi, I'm Tom. I have coded all of the goals pages. I have written the code and content of each goals page to allow the user to learn more about each of our selected goals."
        }
      }
    }
  }
}
